<dict>
  <key>PayloadType</key>
  <string>com.apple.dnsSettings.managed</string>
  <key>DNSSettings</key>
  <dict>
    <key>DNSProtocol</key>
    <string>HTTPS</string>
    <key>ServerAddresses</key>
    <array>
      <string>your.custom.dns</string>
    </array>
    <key>SupplementalMatchDomains</key>
    <array>
      <string>ocsp.apple.com</string>
    </array>
  </dict>
</dict>

